import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-general-terms',
  templateUrl: './general-terms.component.html',
  styleUrls: ['./general-terms.component.scss'],
})
export class GeneralTermsComponent implements OnInit {
  constructor() {}

  pageContent: { title: string; titleColor: string; content: string[] }[] = [
    {
      title: '1. Приемане на Условията',
      titleColor: 'orange',
      content: [
        '1.1. Добре дошли в "Race Fanatic" - вашето местенце за страстта към моторните спортове. Използването на това мобилно приложение (наричано по-нататък "приложението") подлежи на следните условия.',
        '1.2. Преди да се потопите в вълнуващия свят на "Race Fanatic", Ви препоръчваме да отделите време и внимание, за да прочетете внимателно настоящите общи условия. Те са ключови за разбирането на връзката между Вас и нас. Ако не сте съгласни с тези условия, моля, не използвайте приложението и се свържете с нас, ако имате въпроси.',
      ],
    },
    {
      title: '2. Поверителност',
      titleColor: 'yellow',
      content: [
        '2.1. При използването на "Race Fanatic", може да бъдете поканени да предоставите лична информация. За нас важи защитата на вашата поверителност, и ще откриете повече за начина, по който обработваме и защитаваме данните в нашата “Политика за поверителност”.',
        '2.2. С използването на приложението Вие се съгласявате с тези процеси на обработка на данни.',
      ],
    },
    {
      title: '3. Интелектуална собственост',
      titleColor: 'orange',
      content: [
        '3.1. Всички права върху интелектуалната собственост, свързана с "Race Fanatic", включително, но не само, авторски права, търговски марки и патенти, са запазени от нас и нашите партньори.',
        '3.2. Използването на приложението не Ви предоставя права върху интелектуалната собственост на "Race Fanatic". Съгласни сте да не възпроизвеждате, модифицирате, разпространявате или използвате материали от приложението без нашето явно писмено съгласие.',
      ],
    },
    {
      title: '4. Отговорности',
      titleColor: 'yellow',
      content: [
        '4.1. Приложението се предоставя в настоящия вид и не носим отговорност за това дали е подходящо за конкретни нужди и/или за възможни неудобства, които могат да възникнат при неговото използване.',
        '4.2. Връзките към трети страни, включени в приложението, се предоставят за Ваше удобство. Ние не носим отговорност за съдържанието или практиките за поверителност на тези трети страни.',
      ],
    },
    {
      title: '5. Промени в условията',
      titleColor: 'orange',
      content: [
        'Разбираме, че условията могат да се променят. Всяка промяна ще бъде известена чрез приложението. С продължаването на използването му след такава промяна се счита, че сте запознати и съгласни с новите условия.',
      ],
    },
  ];

  ngOnInit() {}
}
